package Stack;

import java.util.ArrayList;

public class Stack_2<T extends Number & Comparable> {
    private Stack<T> stack;
    private Stack<T> minimums;
    private double sum;
    private int size;

    public Stack_2() {
        this.stack = new Stack<T>();
        this.minimums = new Stack<T>();
        double sum = 0;
        int size = 0;
    }

    public int size() {
        return this.size;
    }

    public void push(T value) {
        this.stack.push(value);
        this.sum += value.doubleValue();
        this.size++;
        if (this.minimums.size() == 0 || value.compareTo(this.minimums.peek()) <= 0) {
            this.minimums.push(value);
        } else {
            this.minimums.push(this.minimums.peek());
        }
    }

    public T pop() {
        T temp = this.minimums.pop();
        this.sum -= temp.doubleValue();
        this.size--;
        return this.stack.pop();
    }

    public T peek() {
        return this.stack.peek();
    }

    // Задача 6. Добавьте в стек функцию, возвращающую текущий минимальный элемент в нём за O(1) (подсказка: используйте второй стек).
    // Сложность по времени: O(1) - берётся верхняя из стека минимумов.
    // Сложность по памяти: O(n) - создаётся дополнительный стек, равный по размеру предыдущему.
    public T min() {
        return this.minimums.peek();
    }

    // Задача 7. Добавьте в стек функцию, которая возвращает среднее значение всех элементов в стеке. Она должна выполняться за O(1).
    // Сложность по времени: O(1) - переменная double делится на переменную int.
    // Сложность по памяти: O(1) - поддерживается две лишних переменных.
    public double average() {
        return this.sum/this.size;
    }
}

class StackUtilities {
    // Задача 4. Напишите функцию, которая получает на вход строку, состоящую из открывающих и закрывающих скобок и, используя только
    // стек и оператор цикла, определите, сбалансированы ли скобки в этой строке.
    // Сложность по времени: O(n) - всегда надо пробежать весь стек.
    // Сложность по памяти: O(n) - для анализа строки длиной n создаётся стек длиной n.
    public static boolean balanced(String s) {
        Stack<Character> checkerStack = new Stack<Character>();
        for (int i = 0; i < s.length(); i++) {
            char symbol = s.charAt(i);
            if (symbol == '(') {
                checkerStack.push('(');
            } else if (symbol == ')') {
                if (checkerStack.size() == 0) {
                    return false;
                }
                checkerStack.pop();
            }
        }
        return (checkerStack.size() == 0);
    }

    // Задача 5. Расширьте фукнцию из предыдущего примера, если скобки могут быть трех типов: (), {}, [].
    // Сложность по времени: O(n) - всегда надо пробежать весь стек.
    // Сложность по памяти: O(n) - для анализа строки длиной n создаётся стек длиной n.
    public static boolean balancedExtended(String s) {
        Stack<Character> checkerStack = new Stack<Character>();
        for (int i = 0; i < s.length(); i++) {
            char symbol = s.charAt(i);
            switch (symbol) {
                case '(', '[', '{' -> checkerStack.push(symbol);
                case ')', ']', '}' -> {
                    if (checkerStack.size() == 0) {
                        return false;
                    }
                    char checkSymbol = checkerStack.pop();
                    if ( (checkSymbol == '(' && symbol != ')') ||
                            (checkSymbol == '[' && symbol != ']') ||
                            (checkSymbol == '{' && symbol != '}') )
                        return false;
                }
            }
        }
        return (checkerStack.size() == 0);
    }

    //Задача 6. Добавьте в стек функцию, возвращающую текущий минимальный элемент в нём за O(1) (подсказка: используйте второй стек).
    // Я помню, что задачи со звёздочкой мы выносим в файл с постфиксом _2. Но в таком случае мы получим сложно O(n) и изуродуем исходный стек.
    // Я выношу эту функцию в Stack.java. Здесь оставлю этот говнокод как пример того, как нельзя писать.
    public static int minInStack(Stack<Integer> stack) {
        if (stack.size() == 0) throw new IllegalArgumentException("Этой функции нельзя скармливать пустой стек");
        Stack<Integer> stackForCheck = new Stack<Integer>();
        stackForCheck.push(stack.pop()); // инициализация, как она есть (мне не нравится, что в процессе поиска наименьшего значения я корёжу исходный стек, это надо менять)
        int iterations = stack.size();
        for (int i = 0; i < iterations; i++) {
            int element = stack.pop();
            if (element < stackForCheck.peek()) {
                stackForCheck.push(element);
            }
        }
        return stackForCheck.peek();
    }
}


/* Рефлексия.

9. **Метод, который "переворачивает" связный список**.
Нужно изменить направление ссылок между узлами так, чтобы каждый предыдущий узел стал следующим для текущего. Пробегаемся по всему списку, аккуратно меняем местами указатели для каждого узла, и в заключение не забываем поменять head и tail.
В лучших традициях - наворчать и усложнить, я замутил два решения. Первый - через промежуточный список. Можно сказать - ну зачем? А ответ прост, хотя и не очевиден: эта функция возращает новый, отражённый список, не меняя старый. То есть,
во-первых, вот она - иммутабельность во всей красе, а во-вторых, мы можем поработать с отраженным списком, как-то его расширить, дополнить, почистить, а потом вернуться к исходному, если это будет нужно. Но, поскольку этого не требовалось,
я реализовал переделку исходного списка: берётся хвост, предпоследний узел и предпредпоследний. Хвост становится головой, а дальше идёт перемена next и prev (предпредпоследний нужен для того, чтобы список не разорвался в процессе).

10. **Проверка, имеются ли циклы внутри списка.**
Цикл for по элементам до длины списка, и если конечным узлом не будет хвост, значит в списке есть цикл.
Очень спорный момент, я позволю себе не согласиться и даже поспорить. В условии задачи не было переменной (т.е. параметра) length. Сейчас понимаю, что категорически напрасно. У огромного количества встроенных классов (взять хотя бы те же String)
есть отдельно хранимая длина, которая позволяет не тратить кучу процессорного времени на вычисления длины раз за разом, а хранить значение в отдельной переменной. Тогда да, идея прекрасная, вызвали length раз next, и если не хвост, то всё, где-то
цикл. Я же в какой-то момент сдался и пошёл искать, нет ли алгоритмов, которые позволяют проверить зацикленность в сложных последовательных структурах. Алгоритм Флойда, он же алгоритм черепахи и зайца, заключается в том, что за один проход по
циклу первый указатель совершает один переход next, а второй - сразу два. Если на какой-то итерации оба этих указателя пошли по циклическому маршруту - они обязательно встретятся. А если быстрый добежал до хвоста раньше медленного, то список
не ломаный. Не перестаю восхищаться людьми, которые изобретают такие алгоритмы - что творится в такой голове? Почему я так не могу, да и не смогу никогда, наверное?

11. **Сортировка списка**.
Сортировка пузырьком лучше всего подходит для связного списка.
(Проходили его на курсе для начинающих с полного нуля :) Погуглите что это такое).
Если в узлах можно менять значения, то и в самом деле, там легко и непринужденно можно накрутить сортировку пузырьком, т.к. меняются значения соседних ячеек. Если же приходится именно что жонглировать ссылками, то там как-то много работы.
Или я просто начал рисовать стрелочки на бумаге, как я себе представляю подходящую сортировку, и попытался нагуглить по описанию, что же я нарисовал. Гугл попросил уточнений, как именно работает мой алгоритм и предположил, что это может быть
сортировка вставкой, но она слегка по другому реализуется. Мне понравилось, и я использовал её. По факту, мне кажется, что такое обилие алгоритмов сортировки нужно плюс-минус для того, чтобы научить студента думать алгоритмически.

12. **Слияние списков**.
Обобщим сразу на произвольное количество входных списков (на входе - список связных списков). Эти списки предварительно надо отсортировать, и поочерёдно сканируя текущие элементы списков, выдаём в результирующий список тот элемент,который наиболее
подходит по свойству упорядоченности (например, минимальный из всех текущих, если сортируем по возрастанию).
Есть и более эффективные подходы, в частности использовать т.н. "кучу" (изучаем далее), из которой текущий минимальный элемент извлекается "автоматически".
О том, что можно получить список связных списков я не подумал, поэтому шёл исключительно по простому пути: сравнил два узла у отсортированных списков, выбрал наименьший, перешёл к следующему узлу, повторил, пока один из списков не закончился.
Потом пробежался до хвоста оставшегося, автоматически добавляя узлы в итоговый список. У всех моих решений наблюдается общая черта - я делаю задание, оставаясь исключительно в рамках текущей абстракции. Добавить пару параметров (типа length) или
перейти к использованию чего-то дополнительного что-то не пускает. Вот прямо сейчас возьму и перепишу решение задач по классу Stack с встроенного в java.utils ArrayList на собранный лично мной LinkedList_2. Посмотрим, как изменится сложность О.

13. **Dummy**.
Идея, что создаём отдельный класс Dummy (наследник основного узла), и в циклах не узлы сравниваем, а проверяем тип узла -- он Dummy или нет.
Нередкая ошибка - добавлять в дамми отдельный флажок (или вообще не делать Dummy, а впихивать флажок в основной класс Node). Наоборот, мы стараемся избежать ненужных дополнительных состояний узла и сделать проверки в коде более выразительными.

В дополнение к dummy-узлам может создаваться также круговой связанный список, когда последний узел соединяется с первым узлом, создавая цикл. В таком случае можно обойтись вообще одним dummy-узлом, который будет одновременно и head, и tail [6-006].

Сделал я Dummy узел, и даже немного пообижался на автора заданий, которые не предусматирвают использование этой технологии в рамках выполнения предыдущих 12 задач. Потому что в каждой функции у нас куча проверок: если пустой список, и узлов нет;
если 1 узел, он же голова, он же хвост; если в процессе работы функции изменилась голова; если изменился хвост; и наконец, итоговый случай, с которого начинаются рассуждения о работе функции - работа с некрайним узлом непустого списка. Это даже
текстом описывать долго, не говоря уже о коде. Насколько же приятнее работать с головой и хвостом, которые не меняются, потому что они относятся к отдельному классу, и head/tail ссылки списка благодаря им не меняются. Мечта хозяйки!

*/