package Stack;

import java.util.*;
// я решил, что эта строка - это подсказка: я буду использовать ArrayList для внутреннего хранилища

public class Stack<T extends Comparable> {
    ArrayList<T> storage;

    // Курс "Практика в программировании на АСД. Задание 1.
    // Подберите в вашем языке программирования подходящую динамическую структуру данных для хранения стека. Реализуйте методы size(), pop(), push() и peek().
    public Stack() {
        this.storage = new ArrayList<>();
    }

    // Задание 2. Переписать с хвоста на голову, код от задания 1 будет в комментариях.
    // Сложность решения по времени: O(1). В ArrayList есть параметр size и функция size(), которая его возвращает.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public int size() {
        // размер текущего стека
        // с задания 1 на задание 2 менять нечего
        return this.storage.size();
    }

    // Сложность решения по времени: O(1). В ArrayList есть подходящий функции removeFirst() и removeLast(), которые подходят для удаления из начала или конца списка. При этом нужное значение предварительно сохраняется, чтобы потом было, что возвращать.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public T pop() {
        if (!this.storage.isEmpty())
            //return (T) this.storage.removeLast();
            // С задания 1 на задание 2 неприятно меняется сложность по времени. Раньше O(1) добавления в хвост, разбавленная редким O(n) расширением массива, давала О(1), вычисленной банковским методом.
            // А здесь копируется со смещением массив сам в себя на каждом вызове функции, это любым способом вычисления О(n). Мне не нравится. Но уходить на LinkedList я не хочу, я два задания подряд их писал, мне не нравится. )))
            return (T) this.storage.removeFirst();
        return null;  // если стек пустой
    }

    public void push(T val) {
        // ваш код
        //this.storage.add(val);
        // Раньше push давал чистейший О(1) банковским методом, теперь он даёт честные O(n) на любом вызове. Возможно, нужен переход на LinkedList.
        this.storage.add(0, val);
    }

    // Сложность решения по времени: O(1). В ArrayList есть подходящий функции getFirst() и getLast(), которые подходят для удаления из начала или конца списка. При этом нужное значение предварительно сохраняется, чтобы потом было, что возвращать.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public T peek() {
        // ваш код
        if (!this.storage.isEmpty())
            //return (T) this.storage.getLast();    // ничего не изменилось.
            return (T) this.storage.getFirst();
        return null; // если стек пустой
    }

    // Задание 3. Не запуская программу, скажите, как отработает такой цикл?
    //
    // while (stack.size() > 0)
    //    stack.pop()
    //    stack.pop()
    // Если элементов в стеке чётное количество, то он цикл повыдёргивает их из стека сверху донизу, последним выдаст тот, что когда-то положили первым.
    // Если элементов нечётное количество, выдаст то же самое, но после последнего ещё и null вернёт.
}
