package Stack;

import java.util.*;
// я решил, что эта строка - это подсказка: я буду использовать ArrayList для внутреннего хранилища

public class Stack<T> {
    ArrayList storage;

    // Курс "Практика в программировании на АСД. Задание 4.
    // Подберите в вашем языке программирования подходящую динамическую структуру данных для хранения стека. Реализуйте методы size(), pop(), push() и peek().
    public Stack() {
        this.storage = new ArrayList();
    }

    // Сложность решения по времени: O(1). В ArrayList есть параметр size и функция size(), которая его возвращает.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public int size() {
        // размер текущего стека
        return this.storage.size();
    }

    // Сложность решения по времени: O(1). В ArrayList есть подходящий функции removeFirst() и removeLast(), которые подходят для удаления из начала или конца списка. При этом нужное значение предварительно сохраняется, чтобы потом было, что возвращать.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public T pop() {
        if (!this.storage.isEmpty())
            return (T) this.storage.removeLast();
        return null;  // если стек пустой
    }

    public void push(T val) {
        // ваш код
        this.storage.add(val);
    }

    // Сложность решения по времени: O(1). В ArrayList есть подходящий функции getFirst() и getLast(), которые подходят для удаления из начала или конца списка. При этом нужное значение предварительно сохраняется, чтобы потом было, что возвращать.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public T peek() {
        // ваш код
        if (!this.storage.isEmpty())
            return (T) this.storage.getLast();
        return null; // если стек пустой
    }
}