package Deque;

public class Deque_2 {
    public static boolean isPalindrom(String checkForPalindrom) {
        Deque<Character> deq = new Deque<Character>();
        for (char symbol : checkForPalindrom.toCharArray()) {
            deq.addTail(symbol);
        }
        while(deq.size() >= 1) {
            if ( !deq.removeFront().equals(deq.removeTail()) ) {
                return false;
            }
        }
        return true;
    }
}

/*
4. **Баланс открывающих и закрывающих скобок**.
5. **Баланс открывающих и закрывающих скобок трёх типов**.
Для каждого символа в строке:
- Если символ — открывающая скобка любого типа, добавьте её в стек.
- Если символ — закрывающая скобка:
---- Проверьте, пуст ли стек. Если пуст — баланс нарушен (закрывающая скобка без пары).
---- Извлеките последнюю открывающую скобку из стека.
---- Сравните скобки. Если типы не совпадают - например, ( и ] - баланс нарушен.
После обработки всех символов:
- Если стек не пуст — есть незакрытые скобки (баланс нарушен).
- Если стек пуст — все скобки сбалансированы.
Если типов скобок много - например 100, для удобства проверки совпадения типов можно использовать словарь (ключ -
открывающая скобка , значение - закрывающая скобка).
*/
/*
Собственно, этот подход мне показался очевидным, хотя множественные || в задаче №5 вызывали желание что-то с этим сделать
уже на этапе скобок 3 типов. По неочевидным причинам словарь в Python мнится мне базовым типом, там в целом list и dict -
это такая же встроенная базовая база, как int и double. А вот в Java любой класс из java.util кажется тяжеловесной
надстройкой, которой, конечно, можно воспользоваться, по условию задачи не возбраняется, но как будто бы одновременно с
этим и некий перебор. Так в Python замыкания и декораторы я ощущаю как что-то органичное и на кончиках пальцев, а для
Java это какой-то хай-тек и новодел, к которому попробуй привыкни. Наверное, дело в том, что на Python я пишу уже 5 лет,
а Java вспоминаю всего полгода, да и то с крайне низкой базы.
*/
/*
6. **Текущий минимальный элемент в стеке за O(1)**.
Используем два стека: основной и хранение минимумов.
Когда добавляем элемент в основной стек:
если стек минимумов пуст или новый элемент меньше или равен текущему минимуму (вершина стека минимумов), то добавляем
этот элемент и в стек минимумов. Когда удаляем элемент из основного стека: если удалённый элемент равен вершине стека
минимумов (меньше вершины он не может быть по логике алгоритма), удалите вершину и из стека минимумов.
*/
/*
Тоже так думал сделать, а потом три раза добавил в стек с большими числами значение 1, и после удаления из обоих стеков
оказалось, что в основном стеке на самом верху лежит 1, а в стеке минимумов уже 100. Сделал такой финт - сколько чисел
больше либо равных нашему минимуму было добавлено в основной стек, столько раз текущий минимум добавляется в стек
минимумов. И если на верху стопки у нас лежит ...-1-5-100-1-1, то на верху стопки минимумов лежат ...-1-1-1-1-1. Это
сохраняет баланс хранимых значений и хранимых минимумов (кроме того, нигде в условии задачи на сказано, что значения не
могут совпадать).
*/
/*
7. **Среднее значение всех элементов в стеке за O(1)**.
Добавляем в класс приватную переменную, которая будет хранить текущую сумму всех элементов в стеке. При добавлении
элемента в стек прибавляем его к этой сумме, а при удалении вычитаем.
Среднее значение можно получить в любой момент, разделив эту сумму на текущее количество элементов в стеке.
*/
/*
Первое, что пришло мне в голову. Правда, оказалось, что мой стек хранит любые значения типа T, а для хранения суммы этих
значений, их надо унаследовать от общего для всех Integer, Double и прочих классов класса Number, а заодно ещё и явно
указать, что они Comparable (т.к. без этого не получалось сравнивать их для хранения стека минимумов). В общем и целом,
ради двух в общем-то простых функций пришлось навертеть сложную конструкцию, всё ради скорости, всё ради О(1).
*/
/*
8. **Постфиксная запись выражения**.
Нередкая ошибка: записывать оба аргумента в одной строке, наподобие

a.pop() + b.pop()

Если вы добавите вычитание и деление, код может получиться таким:

a.pop() - b.pop()

Тут уже возможна потенциальная ошибка: вы полагаетесь на конкретный порядок вычисления выражения, что в общем случае
рискованно. Возможно, в выражении сперва будет вычислен не левый pop(), а правый pop() (или наоборот, или в случайном
порядке каждый раз из-за оптимизации какой-нибудь). Например, у вас в стеке (3, 5) , и может получиться 5-3 или 3-5 в
зависимости от порядка, и соответственно разные результаты.

Копипастить вычисление аргументов для каждой операции тоже плохо, ведь в общем случае операции может быть очень много:

a = pop()
b = pop()
a + b
...
a = pop()
b = pop()
a - b

Лучшая схема: и сами операции вынести в декларативный вид, например, используя лямбда-функции. С помощью словаря, где
ключ - операция, а значение - соответствующая функция.
*/
/*
Как и в случае со скобками, идеи использовать словарь лямбда-функций мне даже на ум не пришло, хотя фабрика функций -
это тема, о которой я читал в "Совершенном коде" Стива МакКоннелла ещё 15 лет назад. В Python я такое бы реализовал,
наверное, сразу же, и потом долго хвастался бы на рефлексии. На Java мне такое даже на ум не пришло. Тот же МакКоннелл
предупреждал, что люди в большинстве своём не программируют, а кодят, т.е. не мыслят оптимальными абстракциями под
которые можно написать целые библиотеки, лишь бы мысль была выражена кратко, ёмкуо и однозначно. Нет, люди садятся
писать код, не подумав как следует о том, что они будут писать. И если размышлять письменно на естественном языке -
очень органично и правильно, то размышлять на языке программирования - это сознательно отрезать себя от всех известных
парадигм и способов проектирования, не реализованных в данном языке. Люди, которые реализовывали ФП на Java или бэкэнд
в экосистеме JavaScript, явно не сковывали себя такими глупостями. ^_^
 */
