package Queue;

public class Queue_2 {

    // Курс "Практика в программировании на АСД. Задание 5.
    // Задача 3. Напишите функцию, которая "вращает" очередь по кругу на N элементов.
    // Сложность решения по времени: O(n). В худшем случае n может превышать длину очереди в r+1 раз.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public static void rotate (Queue queue, int shift) {
        for (int i = 0; i < shift; i++) {
            queue.enqueue(queue.dequeue());
        }
    }

}
