package Queue;

import Stack.Stack;

public class Queue_2 {

    // Курс "Практика в программировании на АСД. Задание 5.
    // Задача 3. Напишите функцию, которая "вращает" очередь по кругу на N элементов.
    // Сложность решения по времени: O(n). В худшем случае n может превышать длину очереди в r+1 раз.
    // Сложность решения по пространству: О(1). Ничего нового не создаётся.
    public static void rotate(Queue queue, int shift) {
        for (int i = 0; i < shift; i++) {
            queue.enqueue(queue.dequeue());
        }
    }
    // Задача 5. Добавьте функцию, которая обращает все элементы в очереди в обратном порядке.
    // Сложность решения по времени: O(n). Всегда надо пробежать всю очередь.
    // Сложность решения по пространству: О(n). Создаётся стек размера n.
    public static void reverse(Queue queue) {
        Stack<Integer> tempStack = new Stack<Integer>();
        int size = queue.size();
        for(int i = 0; i < size; i++) {
            tempStack.push(queue.dequeue());
        }
        for(int i = 0; i < size; i++) {
            queue.enqueue(tempStack.pop());
        }
    }
}

// Задача 4. Реализуйте очередь с помощью двух стеков.
class StackedQueue<T extends Comparable> {      // потому что в моей реализации стека T наследует Comparable
    private Stack<T> main;
    private Stack<T> temp;
    int size;

    public StackedQueue() {
        this.main = new Stack<T>();
        this.temp = new Stack<T>();
        this.size = 0;
    }

    public int size() {
        return this.size;
    }

    public boolean isEmpty() {
        return this.size == 0;
    }

    public void enqueue(T value) {
        main.push(value);
        this.size++;
    }

    public T dequeue() {
        if (isEmpty()) throw new IllegalStateException("Нельзя достать что-то из пустой очереди.");
        for (int i = 0; i < this.size; i++) {
            this.temp.push(this.main.pop());
        }
        T value = this.temp.pop();
        this.size--;
        for (int i = 0; i < this.size; i++) {
            this.main.push(this.temp.pop());
        }
        return value;
    }
}

// Рефлексия.
//
// Динамический массив на основе банковского метода.
// При добавлении элемента например амортизационные 3 (1 реальные расходы + 2 кладем в банк).
// При удалении амортизационные 2 (1 + 1).
// При реаллокации (добавляем N элементов) - из банка списывается N.
// Когда надо выполнять реаллокацию, вопрос неоднозначный, можно по некоторому порогу в банке, но лучше когда внутренний массив весь заполнен.
// При уменьшении в реаллокации, в принципе, делать ничего не надо, или например 10% * N списать.

// Здесь меня мои рассчёты не обманули, амортизационные 3 за каждый append прекрасно раскладываются на n реальных затрат и 2*n в активе.
// Проблемы в рассчётах, на мой взгляд, появляются при использовании insert и delete, когда задействованы индексы. Каждый insert
// требует сдвига (length - index) элементов при вставке значения в позицию index, как и при вызове removе. Таким образом, при объёме
// 2*n на счёте при полностью заполненном хранилище два insert по индексу 0, по идее, обнуляют счёт:
// первая вставка требует создания нового внутреннего массива объёмом 2*capacity, и последовательного копирования всех элементов;
// вторая вставка копирует каждый из n элементов на позицию n+1, начиная с хвоста, чтобы освободилось место под вставку на место номер 0.
// Похожие проблемы наблюдаются с удалением. При подробном разборе внутреннего устройства реального ArrayList из пакета java.util я
// осознал, что я, пожалуй, текущее задание по очередям реализую по принципу работы связного списка с DummyNode.
// У меня лично есть стойкое ощущение, что для реализации стека можно (а возможно, что и должно) использовать скрытый массив, а для
// реализации очереди всё-таки связный список. Исключительно благодаря банковскому методу анализа.

// Многомерный динамический массив.
// Идея, что у нас есть интерфейс добавления элемента в некоторую многомерную позицию (i,j,k,...), а внутри это обычный одномерный динамический массив.
// Надо просто корректно реализовать операцию добавления элемента (отображение многомерной координаты в линию).
// Например, входной размер массива 3x4x5, создаём одномерный массив длиной 60, и многомерная координата внутри него элементарно определяется.

// Многомерный массив вызвал бурление, попросту оттого, что я не до конца понимал, как же я буду выбирать, по какой оси производить
// расширение данного массива. Проблема решилась поискам наименьшей размерности, чтобы увеличивать по ней. Благодаря этому трёхмерный,
// например, массив не превращается в бесконечно растущий по одной стороне "брус", а становится элегантным "почти кубиком". Ниже привожу
// примерное описание эмоций в процессе выполнения, в принципе, не такого уж и сложного задания:
// Самый первый и самый простой затык: каждая из "осей" многомерного массива может масштабироваться отдельно. Хорошо. Допустим, он двумерный, для иллюстрации 2*2, и заполнен:
//        1   2
//        3   4
//и мы делаем append(5), добавляя значение в заполненный массив. Как оно должно выглядеть:
//        1    2    5
//        3    4    пусто
//        или
//        1    2
//        3    4
//        5    пусто.
// Когда я делаю insert(5, [0, 1]), получается
//        1    5    2
//        3    4    п
//        или
//        1    5
//        3    2
//        п    4
// Я уже молчу, что даже трёхмерный массив целых чисел взрывает мне мозг, а пятимерный массив я в принципе представить не могу, отчего каждый
// день порываюсь написать Вам, что перевёл кучу бумаги, чертя схемы и записывая псевдокод ручкой ( а сколько раз, матерясь, нажимал Ctrl-A,
// Delete и набирал всё заново...).
// А всего-то надо было взять день перерыв и обдумать другие вопросы: как выбирать оси, как учитывать наполняемость и т.д.
