package DynamicArray;

public class DynArray_2 {
    // Курс "Практика в программировании на АСД. Задание 3.
    // Задание 6. Динамический массив на основе банковского метода амортизационного анализа.
    // Структура данных уже реализована на основе указанного метода, т.к. это техника анализа, а не реализации.
    // Рассмотрим функцию append():
    // Реальная стоимость: O(1) в среднем, O(n) при расширении. Но нас-то интересует амортизированная стоимость:
    // при прохождении подобного курса на Python каждой операции присваивали 3 токена.
    // 1 токен тратится при добавлении элемента в конец списка, а 2 попадают на "банковский счёт".
    // Т.е., если нарушить общепринятую нотацию, добавление элемента - О(3), а не О(1).
    // При расширении встроенного массива вдвое происходит копирование элементов, эти затраты учитываются со "счёта", т.е.
    // если в массиве уже n элементов, то на "счёте" находится 2*n токенов, из которых n вычитается при учёте операции
    // копирования. Т.к. операция копирования стоит O(1), но на балансе находится уже не 2*n, а n токенов.
    // При дальнейшем расширении динамического массива баланс только продолжает нарастать.
     
}
